{"name":"Mirac Can Yılmaz","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Mirac Can Yılmaz - curious","headerTaglineThree":"DevOps Engineer","headerTaglineFour":" based from Turkey","showCursor":true,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/miraccan00"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/mirac-can-yilmaz/"},{"id":"3","title":"Twitter","link":"https://twitter.com/miraccan00"},{"id":"4","title":"Blog","link":"miraccanyilmaz.me/blog"},{"id":"5","title":"Email","link":"mailto:miraccanyilmazme@gmail.com"}],"projects":[],"aboutpara":"Hello! I am a DevOps Engineer with 1.5 years of experience, currently working at Softtech. In my role, I take an active role in implementing in-depth Kubernetes resources, including the meticulous configuration of health checks, Horizontal Pod Autoscaling (HPA), and other advanced strategies to ensure optimal server performance. I am passionate about staying on top of emerging technology to promote efficiency and am driven by a curiosity for all things programming.","resume":{"tagline":"👋  I'm a DevOps engineer.","description":"Certainly! A DevOps engineer with a proven track record in streamlining software development and IT operations. Skilled in implementing robust automation processes, optimizing deployment pipelines, and ensuring seamless collaboration between development and IT teams. Proficient in a variety of tools and technologies related to infrastructure as code, continuous integration, and continuous deployment. Experienced in managing scalable and reliable cloud-based architectures. Dedicated to enhancing efficiency, reliability, and security in software delivery.","experiences":[{"id":"1","dates":"March 2022 - Present","type":"Full Time","position":"DevOps Engineer at Softtech","bullets":"OpenShift - Kubernetes - Docker - Containerization - Microservices - Jenkins - Nexus - Python - Bash"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"Jun 2022 - Nov 2022","type":"Full Time","position":"DevOps Engineer at Payten","bullets":"OpenShift - Kubernetes - Docker - Containerization - Microservices - Jenkins - Nexus - Python - Bash"},{"id":"b8b12c82-84f5-4576-8522-0102c25e27da","dates":"Feb 2022 - Jun 2022","type":"Internship","position":"Software Engineer Intern at Duzce University","bullets":"Worked on the Backend of a .NET application"}],"education":{"universityName":"Duzce University","universityDate":"2018-2022","universityPara":"During my time at university, I was passionate about software and technology, which led me to pursue a degree in Computer Science. I actively engaged in various coding projects, hackathons, and technology-related extracurricular activities, honing my skills in areas such as algorithms, data structures, and software development methodologies. This deep passion motivated me to excel in my coursework and explore innovative solutions to real-world problems. Through my academic journey, I cultivated a strong foundation in programming languages, software engineering principles, and problem-solving techniques, which continue to drive my enthusiasm for the tech industry."},"languages":["Python","Go"],"frameworks":["Django","SpringBoot"],"others":["Azure DevOps","Github Actions","Jenkins","ArgoCD","HelmCharts","Nexus","Harbor","Prometheus","Grafana"]}}